
ZODIAC_SIGNS = [
    "மேஷம்", "ரிஷபம்", "மிதுனம்", "கடகம்",
    "சிம்மம்", "கன்னி", "துலாம்", "விருச்சிகம்",
    "தனுசு", "மகரம்", "கும்பம்", "மீனம்"
]

DOSHAM_RULES = {
    "Chevvai": {"houses": {1, 2, 4, 7, 8, 12}, "planet": "செவ்வாய்"},
    "Rahu": {"houses": {1, 4, 5, 7, 8, 10, 12}, "planet": "ராகு"},
    "Ketu": {"houses": {1, 5, 7, 8, 12}, "planet": "கேது"},
}

THITHI_NAMES = [
    "பிரதமை", "துவிதியை", "திரோதியை", "சதுர்த்தி", "பஞ்சமி",
    "ஷஷ்டி", "சப்தமி", "அஷ்டமி", "நவமி", "தசமி",
    "ஏகாதசி", "துவாதசி", "திரயோதசி", "சதுர்த்தசி", "பௌர்ணமி",
    "பிரதமை", "துவிதியை", "திரோதியை", "சதுர்த்தி", "பஞ்சமி",
    "ஷஷ்டி", "சப்தமி", "அஷ்டமி", "நவமி", "தசமி",
    "ஏகாதசி", "துவாதசி", "திரயோதசி", "சதுர்த்தசி", "அமாவாசை"
]

YOGA_NAMES = ["விஷ்கம்பம்", "ப்ரீதி", "ஆயுஷ்மான்", "சௌபாக்கியம்", "சோபனம்", "அதிகண்டம்", "சுகர்மம்", "திரோதியை", "சூலம்", "கண்டம்", "விருத்தி", "துருவம்", "வியாகதம்", "அரிசணம்", "வச்சிரம்", "சித்தி", "வியாதிபாதம்", "வரியான்", "பரிகம்", "சிவம்", "சித்தம்", "சாத்தியம்", "சுபம்", "சுப்பிரம்", "பிராமியம்", "ஐந்திரம் (மாஹேத்திரம்)", "வைதிரோதியை (வைத்திருதி)"]

RASI_NAMES = {
    'Ari': 'மேஷம்', 'Tau': 'ரிஷபம்', 'Gem': 'மிதுனம்', 'Can': 'கடகம்',
    'Leo': 'சிம்மம்', 'Vir': 'கன்னி', 'Lib': 'துலாம்', 'Sco': 'விருச்சிகம்',
    'Sag': 'தனுசு', 'Cap': 'மகரம்', 'Aqu': 'கும்பம்', 'Pis': 'மீனம்'
}

PLANET_NAMES = {
    'Sun': 'சூரியன்', 'Moon': 'சந்திரன்', 'Mars': 'செவ்வாய்',
    'Mercury': 'புதன்', 'Jupiter': 'குரு', 'Venus': 'சுக்ரன்',
    'Saturn': 'சனி', 'True_Node': 'ராகு', 'True_South_Node': 'கேது'
}



